Revit 2021.1 API
Alignment.GetDistance Method
 Calculates the relative distance along the alignment between two stations based on their alignment distances according to Revit Internal Origin Coordinate Base. The distance may be positive or negative depending on the relative positions of the input stations on the alignment.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2021.1
Syntax
C#
public double GetDistance(
	double fromStation,
	double toStation
)
Visual Basic
Public Function GetDistance ( _
	fromStation As Double, _
	toStation As Double _
) As Double
Visual C++
public:
double GetDistance(
	double fromStation,
	double toStation
)
Parameters
fromStation
Type: System.Double
The displayed alignment station from which 2D length is to be calculated.
toStation
Type: System.Double
The displayed alignment station to which 2D length is to be calculated.
Return Value
Distance (positive or negative) along the alignment between two stations. The sign of the distance depends on the relative positions of the input stations on the alignment.
See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace